InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омPDMНаСервереПовтор/Ext/Module.bsl
Функция ПолучитьДанныеВыгрузки() Экспорт
	
	мНастроек = ПолучитьНаименованиеНастроек();
	стДанныеВыгрузки = Новый Структура();
	
	Для каждого х Из мНастроек Цикл
		стДанныеВыгрузки.Вставить(х,"");
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И НастройкиПроекта.НомерНастройки = 0";
		
	Запрос.УстановитьПараметр("ИмяНастройки", мНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стДанныеВыгрузки[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;
	
	Возврат стДанныеВыгрузки;
	
КонецФункции // ПолучитьДанныеВыгрузки() 


Функция ПолучитьНаименованиеНастроек() 
	
	мНаименованиеНастроек = Новый Массив(13);
	мНаименованиеНастроек[0] 	= "ПутьКФайлуEXE";	
	мНаименованиеНастроек[1] 	= "ПутьКФайлуЗагрузки";	
	мНаименованиеНастроек[2] 	= "ПутьКФайлуEXEПроекта";	
	мНаименованиеНастроек[3] 	= "ПутьКФайлуEXEКонструктор";	
	мНаименованиеНастроек[4] 	= "ПутьКФайлуEXEКомпозиция";	
	мНаименованиеНастроек[5] 	= "ПутьКФайлуEXEГабаритныйЧерчеж";	
	мНаименованиеНастроек[6] 	= "ПутьКФайлуEXEИзменениеСтатусаГЧ";	
	мНаименованиеНастроек[7] 	= "ПутьКФайлуEXEЗагрузкаТЗ";	
	мНаименованиеНастроек[8] 	= "ПутьКФайлуEXEРаздатьПрава";	
	мНаименованиеНастроек[9] 	= "ПутьКФайлуEXEЗабратьПрава";	
	мНаименованиеНастроек[10] 	= "ПутьКФайлуEXEЕстьРазрегестрированные";	
	мНаименованиеНастроек[11] 	= "ПутьКФайлуEXEРаздатьПраваКомпозиции";	
	мНаименованиеНастроек[12] 	= "ПутьКФайлуEXEЗабратьПраваКомпозиции";	
	
	Возврат мНаименованиеНастроек;
	
КонецФункции // ПолучитьНаименованиеНастроек()
